<p><a name="sections"></a></p>


# Sections

- <a href="#DS">Data Structure</a><br>
- <a href="#DM">Data Manipulation</a><br>
- <a href="#grouping">Grouping and aggregration</a><br>
- <a href="#miss">Handling Missing Data</a><br>
- <a href="#sol">Solutions</a><br>

# Pandas

<p><a name="DS"></a></p>
### Data Structure

- Pandas is a Python package built on top of NumPy.  It is useful for special array handling, data manipulation, plotting, and web scraping.  

- There are four new data structure objects in Pandas: Series, DataFrame, Time Series and Panel. The first three will be discussed.

- The *DataFrame* object borrows its name from the R object.  R is a programming language popular among statisticians and data scientists.

- Pandas is particularly strong in the area of handling spreadsheet structures, dealing with missing data, and processing time series data.

These are the new data types introduced by pandas:

- **Series**: 1D labeled homogeneously-typed array.
- **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns.
- **Time Series**: Series with index containing datetimes.
- **Panel**: General 3D labeled, also size-mutable array.

Import the package, as follows:

In [1]:
import numpy as np
import pandas as pd

<p><a name="series"></a></p>
## Series

A series is a one-dimensional array-like object containing homogenously typed elements.   Each element has an associated data label, called its index. By default, the index consists of ordinary array indices, i.e. consecutive integers starting from zero.

In [2]:
obj = pd.Series(['a', 'b', 'c', 'd'])
obj

0    a
1    b
2    c
3    d
dtype: object

Often it will be more desirable to create a series with an index identifying each data point. Here the index is manually set the index from 1 to 4.

In [3]:
obj2 = pd.Series(['a', 'b', 'c', 'd'], index=[1, 2, 3, 4])
obj2

1    a
2    b
3    c
4    d
dtype: object

The attribute `values` represents all the values.

In [4]:
obj.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [5]:
obj.values[1]   # obj.values is simply an array

'b'

The **Series** object is similar to a **dictionary**, `Series.index` is like `dictionary.keys`, and `Series.values` is like `dictionary.values`. Directly convert a dictionary to a Series, as follows:

In [6]:
dict_ = {1: 'a', 2: 'b', 3: 'c', 4: 'd'}
obj3 = pd.Series(dict_)
obj3

1    a
2    b
3    c
4    d
dtype: object

Convert a Series back to a dictionary.

In [7]:
obj3.to_dict()

{1: 'a', 2: 'b', 3: 'c', 4: 'd'}

<p><a name="DF"></a></p>
## DataFrame

A data frame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns.  Each column can be a different type (integers, strings, floating point numbers, Python objects, etc.).  All columns must be the same length, to give the data frame a defined shape.

In [6]:
data = {'commodity': ['Gold', 'Gold', 'Silver', 'Silver'],
        'year': [2013, 2014, 2014, 2015],
        'production_Moz': [107.6, 109.7, 868.3, 886.7]} #world wide in million oz

# convert to DataFrame
df = pd.DataFrame(data)  # data is a dictionary
df

  commodity  production_Moz  year
0      Gold           107.6  2013
1      Gold           109.7  2014
2    Silver           868.3  2014
3    Silver           886.7  2015

The index may be set using the method `set_index`, as follows:

In [7]:
df=df.set_index('year')
df
# year is a bad index because 2014 appears twice

     commodity  production_Moz
year
2013      Gold           107.6
2014      Gold           109.7
2014    Silver           868.3
2015    Silver           886.7

The dataframe can be returned to the original index using the mathod `reset_index`, as follows:

In [8]:
df=df.reset_index()
df

   year commodity  production_Moz
0  2013      Gold           107.6
1  2014      Gold           109.7
2  2014    Silver           868.3
3  2015    Silver           886.7

A data frame can also be created with a nested list. The two ways are equivalent.

In [9]:
df_2=pd.DataFrame([[107.6, 'Gold', 2013],
                   [109.7, 'Gold', 2014],
                   [868.3, 'Silver', 2014],
                   [886.7, 'Silver', 2015]], 
                    columns=['production_Moz','commodity','year'])    # we are passing a nested list > more legible
df_2

   production_Moz commodity  year
0           107.6      Gold  2013
1           109.7      Gold  2014
2           868.3    Silver  2014
3           886.7    Silver  2015

A data frame has an attribute **values**, which is of the multidimensional array type.

In [10]:
print type(df.values)

<type 'numpy.ndarray'>

In [11]:
print df.values
print '-'*55
print df_2.values

[[2013L 'Gold' 107.6]
 [2014L 'Gold' 109.7]
 [2014L 'Silver' 868.3]
 [2015L 'Silver' 886.7]]
-------------------------------------------------------
[[107.6 'Gold' 2013L]
 [109.7 'Gold' 2014L]
 [868.3 'Silver' 2014L]
 [886.7 'Silver' 2015L]]

data frame v.s. series is similar to 2D array v.s. 1D array. A data frame has column names.

In [12]:
print type(df.columns)

<class 'pandas.indexes.base.Index'>

In [13]:
print df.columns  # column name
# here u'year' means the string 'year' is encoded in unicode

Index([u'year', u'commodity', u'production_Moz'], dtype='object')

In [14]:
print df.columns.tolist()

['year', 'commodity', 'production_Moz']

Each column in a DataFrame can be retrieved as a Series. There are two ways to get the column: to retrieve by attribute and to retrieve by dictionary-like notation. They will give the same result.

In [15]:
df.year         # retrieve by attribute

0    2013
1    2014
2    2014
3    2015
Name: year, dtype: int64

In [16]:
df['year']  # retrieve by dictionary-like notation

0    2013
1    2014
2    2014
3    2015
Name: year, dtype: int64

In [17]:
df[['year']] # will return a pandas dataframe

   year
0  2013
1  2014
2  2014
3  2015

In deleting a row the difference between the two notations can be seen.

In [22]:
del(df.year)

AttributeError: year

In [23]:
del(df['year'])
df

  commodity  production
0      Gold       107.6
1      Gold       109.7
2    Silver       868.3
3    Silver       886.7

The name of an individual column may be changed as follows:

In [19]:
df.columns = df.columns.str.replace('commodity','metal')
df

   year   metal  production_Moz
0  2013    Gold           107.6
1  2014    Gold           109.7
2  2014  Silver           868.3
3  2015  Silver           886.7

Indexing a pandas data frame is similar to indexing a numpy array.  In pandas the first index retrieves a column and the second index retrieves the row.  To return the third element of the metal column, use the following:

In [21]:
df['metal'][2]

'Silver'

Slicing a pandas data frame is also similar to slicing a numpy array.  The following code retrns the second and third elements of the production column.

In [23]:
df['production_Moz'][1:3]

1    109.7
2    868.3
Name: production_Moz, dtype: float64

In order to slice multiple columns pass a list of column names.  The following represents the world production of gold and silver in 2014.

In [24]:
df[['metal','production_Moz']][1:3]  # this gives us a pandas dataframe

    metal  production_Moz
1    Gold           109.7
2  Silver           868.3

** Exercise 1** 

Create a Pandas DataFrame, named 'NYC', whose columns are 'boro', 'pop' and 'area'. The frame represents the five boroughs of New York City, including the 2010 census population (in millions),and land area in square miles.  The rows represent the following:

- The Bronx is 42 square miles.  In the 2010 census, the Bronx had 1.39 million people.
- Manhattan, with 2010 population 1.59 million, has an area of 23 square miles.
- Brooklyn is 71 square miles.  The 2010 population was 2.47 million.
- In 2010, Staten Island had 0.44 million inhabitants.  It is 59 square miles.
- 2.23 million people lived across the 109 square miles of Queens, in 2010.

Create a new column representing the population density using:
```
NYC['density']=NYC['pop']/NYC['area']
```

Now set the index of NYC to be the borough names using `set_index` function of a data frame. Make sure you update the DataFrame.

In [25]:
#### Your code here

nyc =pd.DataFrame([
                   ['Bronx', 1.39, 42],
                   ['Manhattan', 1.59, 23],
                   ['Brooklyn', 2.47, 71],
                   ['Staten Island', 0.44, 59],
                   ['Queens', 2.23, 109]
                  ], 
                    columns=['boro','pop','area'])   

nyc['density']=nyc['pop']/nyc['area']
nyc = nyc.set_index('boro')
nyc

                pop  area   density
boro
Bronx          1.39    42  0.033095
Manhattan      1.59    23  0.069130
Brooklyn       2.47    71  0.034789
Staten Island  0.44    59  0.007458
Queens         2.23   109  0.020459

<p><a name="IO"></a></p>
## I/O tools

Pandas has a number of functions for reading tabular data as a data frame object.

In [37]:
!more foo.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [38]:
pd.read_csv('foo.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In some cases, there is no header in the file. By setting `header = None`, the column names will be filled with incremental numbers.

In [39]:
!more foo_noheader.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [40]:
pd.read_csv('foo_noheader.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

Pass the column names (as a list of strings) to the names parameter in `read_csv`.

In [41]:
# Set the names manually
pd.read_csv('foo_noheader.csv', 
             names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Importing files has been covered. This exercise demonstrates file exporting.

**Exercise 2** 

- Write the data frame, `NYC`, to a file, NYC.csv. The function `to_csv` is useful for this task.

In [26]:
nyc

                pop  area   density
boro
Bronx          1.39    42  0.033095
Manhattan      1.59    23  0.069130
Brooklyn       2.47    71  0.034789
Staten Island  0.44    59  0.007458
Queens         2.23   109  0.020459

In [28]:
#### Your code here

nyc.to_csv('NYC.csv')

!more NYC.csv

nyc2=pd.read_csv('NYC.csv')
nyc2

boro,pop,area,density
Bronx,1.39,42,0.0330952380952
Manhattan,1.59,23,0.0691304347826
Brooklyn,2.47,71,0.0347887323944
Staten Island,0.44,59,0.00745762711864
Queens,2.23,109,0.0204587155963

            boro   pop  area   density
0          Bronx  1.39    42  0.033095
1      Manhattan  1.59    23  0.069130
2       Brooklyn  2.47    71  0.034789
3  Staten Island  0.44    59  0.007458
4         Queens  2.23   109  0.020459

<p><a name="DM"></a></p>
# Data Manipulation in Pandas

Like numpy, pandas defines many broadcast operations, as well as numerous methods of manipulating data.
<p><a name="concat"></a></p>
### concat
Pandas DataFrames can be expanded in both directions. First create two data frames.

In [29]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['d','e'],
                   index=['three', 'two','one'])
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

In [30]:
df2

       d  e
three  0  1
two    2  3
one    4  5

Since the two data frames have the same number of rows, it is natural to combine them "horizontally".  Note the concatenation takes place on the name of the index and not the order.

In [49]:
pd.concat([df1, df2], axis = 1)

       a  b  c  d  e
one    0  1  2  4  5
three  6  7  8  0  1
two    3  4  5  2  3

- The argument "axis = 1" means expanding along the column indices. Setting "axis = 0" will combine two data frames with same number of columns vertically.

**Exercise 3**

In the iPython notebook, create the data frame below. How can it be combined it with the old NYC? Observe that this is a data frame with new features.  

There are three new features:

- **high_point** is the location of highest elevation 
- **geography** indicates if the borough is an island, on an island, or mainland
- **inception** indicates the year of incorporation into the City of New York

In [32]:
new_features = pd.DataFrame({'high_point': ['Battle Hill', 'Chapel Farm', 'North Glen Oaks', 'Bennett Park','Todt Hill'],\
                            'geography':['on island','on mainland','on island','is an island','is an island'],\
                           'inception':['1634','1898','1683','1624','1683']},\
                            index=['Brooklyn', 'Bronx', 'Queens', 'Manhattan','Staten Island'])
new_features

                  geography       high_point inception
Brooklyn          on island      Battle Hill      1634
Bronx           on mainland      Chapel Farm      1898
Queens            on island  North Glen Oaks      1683
Manhattan      is an island     Bennett Park      1624
Staten Island  is an island        Todt Hill      1683

In [33]:
nyc

                pop  area   density
boro
Bronx          1.39    42  0.033095
Manhattan      1.59    23  0.069130
Brooklyn       2.47    71  0.034789
Staten Island  0.44    59  0.007458
Queens         2.23   109  0.020459

In [41]:
#### Your code here

nyc = pd.concat([nyc, new_features], axis = 1)
nyc

,pop,area,density,boro,geography,high_point,inception
0,NaN,NaN,NaN,Manhattan,is an island,Bennett Park,1624
1,NaN,NaN,NaN,Brooklyn,on island,Battle Hill,1634
2,NaN,NaN,NaN,Queens,on island,North Glen Oaks,1683
3,NaN,NaN,NaN,Staten Island,is an island,Todt Hill,1683
4,NaN,NaN,NaN,Bronx,on mainland,Chapel Farm,1898
Bronx,1.39,42.0,0.033095,NaN,NaN,NaN,NaN
Brooklyn,2.47,71.0,0.034789,NaN,NaN,NaN,NaN
Manhattan,1.59,23.0,0.069130,NaN,NaN,NaN,NaN
Queens,2.23,109.0,0.020459,NaN,NaN,NaN,NaN
Staten Island,0.44,59.0,0.007458,NaN,NaN,NaN,NaN

<p><a name="sort"></a></p>
### sort
It is possible to order the rows of data frames using `sort_values()`.  This object method takes a column name as an argument.

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values

It is used on the new_features data frame to order by date of inception, as follows:

In [34]:
new_features=new_features.sort_values('inception')
new_features

                  geography       high_point inception
Manhattan      is an island     Bennett Park      1624
Brooklyn          on island      Battle Hill      1634
Queens            on island  North Glen Oaks      1683
Staten Island  is an island        Todt Hill      1683
Bronx           on mainland      Chapel Farm      1898

To return to a standard incremented index use `reset_index`, as follows:

In [35]:
new_features=new_features.reset_index()
new_features

           index     geography       high_point inception
0      Manhattan  is an island     Bennett Park      1624
1       Brooklyn     on island      Battle Hill      1634
2         Queens     on island  North Glen Oaks      1683
3  Staten Island  is an island        Todt Hill      1683
4          Bronx   on mainland      Chapel Farm      1898

Finally, change the name of the column index to boro, as follows:

In [36]:
# we can rename columns this way too:
new_features.columns = ['boro', 'geography', 'high_point', 'inception']

In [37]:
# we could also do this:
new_features.columns = new_features.columns.str.replace('index','boro')
new_features

            boro     geography       high_point inception
0      Manhattan  is an island     Bennett Park      1624
1       Brooklyn     on island      Battle Hill      1634
2         Queens     on island  North Glen Oaks      1683
3  Staten Island  is an island        Todt Hill      1683
4          Bronx   on mainland      Chapel Farm      1898

<p><a name="merge"></a></p>
### merge
Merging is the most common way to combine multiple data frames. Let’s create two data frames first.

In [57]:
df3 = pd.DataFrame([['a','b','c'],['d','e','f'],['g','h','i']]\
                   ,columns=['col1','col2','col3'])
df4 = pd.DataFrame({'col2':['x','e','b','z'],'col4':[1,2,3,4],'col5':['i','f','e','h']})
df3

  col1 col2 col3
0    a    b    c
1    d    e    f
2    g    h    i

In [58]:
df4

  col2  col4 col5
0    x     1    i
1    e     2    f
2    b     3    e
3    z     4    h

Merging will use the 'how' column as a key for the merge.  The code below identifies the column ‘col2’ from both data frames. The argument 'inner' means the merge only keeps rows occur in both data frames.

In [118]:
pd.merge(df3, df4, how='inner', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c     3    e
1    d    e    f     2    f

The default value of the parameter 'how'  is 'inner'. The following code performs the same task as above.

In [119]:
pd.merge(df3, df4, on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c     3    e
1    d    e    f     2    f

To keep every row in df1 then set the parameter how = "left".

In [120]:
pd.merge(df3, df4, how='left', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c   3.0    e
1    d    e    f   2.0    f
2    g    h    i   NaN  NaN

To keep all rows from both df1 and df2, set the parameter how = "outer".

In [121]:
pd.merge(df3, df4, how='outer', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c   3.0    e
1    d    e    f   2.0    f
2    g    h    i   NaN  NaN
3  NaN    x  NaN   1.0    i
4  NaN    z  NaN   4.0    h

If the 'how' column does not have the same name in the two data frames, use 'left_on' and 'right_on' to indicate how to perform the merge.  Note that columns with the same name, in the two data frames, will be named with an x or y character appended.

In [62]:
df5 = pd.merge(df3, df4, left_on='col2', right_on='col5')
df5

  col1 col2_x col3 col2_y  col4 col5
0    d      e    f      b     3    e
1    g      h    i      z     4    h

In [63]:
del(df5['col2_x'])
df5.columns = df5.columns.str.replace('col2_y','col2')
df5

  col1 col3 col2  col4 col5
0    d    f    b     3    e
1    g    i    z     4    h

**Exercise 4**

- Run the following code to create a data frame, 'Elevations'. It contains NYC locations and their elevation in feet.  How is this related to the NYC data frame? Why separate this information into another data frame?
- Combine this data with the NYC data frame in a meaningful way?
- Remove any redundant columns and change the name of the elevation column to 'peak_elevation'.
- Order the data frame by highest to lowest 'peak_elevation'.

In [38]:
Elevations = pd.DataFrame([['Battle Hill',220],['Marcus Garvey Park',103],['Bennett Park',265],\
                           ['Todt Hill',410],['Washington Square Park',27],['Chapel Farm',280],\
                           ['Bryant Park',58],['North Glen Oaks',258],['St Marys Park',47]],
                      columns=['location', 'elevation'])
Elevations

                 location  elevation
0             Battle Hill        220
1      Marcus Garvey Park        103
2            Bennett Park        265
3               Todt Hill        410
4  Washington Square Park         27
5             Chapel Farm        280
6             Bryant Park         58
7         North Glen Oaks        258
8           St Marys Park         47

In [39]:
nyc

                pop  area   density
boro
Bronx          1.39    42  0.033095
Manhattan      1.59    23  0.069130
Brooklyn       2.47    71  0.034789
Staten Island  0.44    59  0.007458
Queens         2.23   109  0.020459

In [40]:
nyc2 = nyc.reset_index()
nyc2

            boro   pop  area   density
0          Bronx  1.39    42  0.033095
1      Manhattan  1.59    23  0.069130
2       Brooklyn  2.47    71  0.034789
3  Staten Island  0.44    59  0.007458
4         Queens  2.23   109  0.020459

In [95]:
# Your code here

nyc3 = pd.merge(nyc2, Elevations, left_on='high_point', right_on='location')
nyc3

,index,pop,area,density,geography,high_point,inception,location,elevation
0,Bronx,1.39,42,0.033095,on mainland,Chapel Farm,1898,Chapel Farm,280
1,Brooklyn,2.47,71,0.034789,on island,Battle Hill,1634,Battle Hill,220
2,Manhattan,1.59,23,0.069130,is an island,Bennett Park,1624,Bennett Park,265
3,Queens,2.23,109,0.020459,on island,North Glen Oaks,1683,North Glen Oaks,258
4,Staten Island,0.44,59,0.007458,is an island,Todt Hill,1683,Todt Hill,410

In [99]:
nyc3.columns = nyc3.columns.str.replace('index','boro')
del(nyc3['location'])  #location is now redundant
nyc3.columns = nyc3.columns.str.replace('elevation','peak_elevation')
nyc3

,boro,pop,area,density,geography,high_point,inception,peak_peak_elevation
0,Bronx,1.39,42,0.033095,on mainland,Chapel Farm,1898,280
1,Brooklyn,2.47,71,0.034789,on island,Battle Hill,1634,220
2,Manhattan,1.59,23,0.069130,is an island,Bennett Park,1624,265
3,Queens,2.23,109,0.020459,on island,North Glen Oaks,1683,258
4,Staten Island,0.44,59,0.007458,is an island,Todt Hill,1683,410

<p><a name="SF"></a></p>
### selection and filter

The `loc` method provides purely label (index/columns)-based indexing. This method allows selection from a data frame by index and columns. 

Consider data frame df1:

In [100]:
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

The following returns a single column of df1.

In [101]:
df1['a']

one      0
two      3
three    6
Name: a, dtype: int32

In [102]:
df1[['a','b']]

       a  b
one    0  1
two    3  4
three  6  7

Using subscripting/slicing as an argument will return the associated rows.  This is not the most straight forward syntax and does not allow the use of string names for the index.

In [214]:
df1[1:2]   # this is strange behavior, I don't like to access rows this way

     a  b  c
two  3  4  5

The following uses `loc` to return a single row of df1, using the index string name.

In [104]:
df1.loc[['two']] # the row that has index two

     a  b  c
two  3  4  5

A second parameter is passed to loc to specify the chosen column. For example:

In [215]:
df1.loc['two', 'b'] # the row that has index two and column b

4

Note the three ways to accomplish this:

In [221]:
print(df1.loc['two', 'b'])  # this makes most sense and is most legible
print(df1[1:2]['b'][0])
print(df1['b'][1])

4
4
4

Fancy indexing can be done with `loc` in pandas, as was done in Numpy. Select a row with a condition, as follows.  The code below returns all columns for the rows in which column 'a' is zero.

In [222]:
df1.loc[df1.a==0,:]  # : means I am taking all of the columns

     a  b  c
one  0  1  2

Columns are selected in a similar way.  The code below returns all rows for the columns in which row 'one' is zero.

In [225]:
df1.loc[:,df1.loc['one']==0]

       a
one    0
two    3
three  6

Note: loc only accepts labels as input. If you try to use numbers, it will give you an error. For example:

In [105]:
df1.loc[1, 2]

TypeError: cannot do label indexing on <class 'pandas.indexes.base.Index'> with these indexers [1] of <type 'int'>

If you want to select data by number, you need the help of iloc. The iloc method provides a purely position based indexing.

In [227]:
# select as a matrix 
# row 2, col 3
df1.iloc[1, 2]

5

In [106]:
# first row, first two columns
# return a Series
row1 = df1.iloc[0, :2]
row1

a    0
b    1
Name: one, dtype: int32

The second row of df1 can be retrieved by each of the following:

In [230]:
print(df1.loc['two'])
print(df1.iloc[1])

a    3
b    4
c    5
Name: two, dtype: int64
a    3
b    4
c    5
Name: two, dtype: int64

**Exercise**

Detail four methods to extract the value 6 from the data frame df1.
```
df1.loc[]
df1.iloc[]
df1[][][] #using subscripting in the first []
df1[][] #using indexing in the first []
```

In [110]:
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

In [115]:
#your code here

print df1.loc['three','a']
print df1.iloc[2,0]
print df1['a']['three']

6
6
6

### Removing rows

The removal of columns has been covered above using `del()`.  This function actually clears memory space on the computer.  The `del` function can not be used to clear rows.

Rows may be cleared in the following ways:

In [236]:
#this removes row 'two'
df1.loc[df1.index != 'two']

       a  b  c
one    0  1  2
three  6  7  8

In [116]:
#this removes row 0 and 2 (first and third)
df1.drop(df1.index[[0,2]])

     a  b  c
two  3  4  5

Columns may also be removed using fancy indexing or `drop`, instead of using `del`.

In [117]:
#this removes row 'two'
df1.loc[:,df1.columns != 'b']

       a  c
one    0  2
two    3  5
three  6  8

In [249]:
#this removes column 'b'
df1.drop('b', axis=1)

       a  c
one    0  2
two    3  5
three  6  8

<p><a name="miss"></a></p>
# Handling Missing Data

Missing or, equivalently, corrupt data is an unavoidable reality in processing large data sets.  There are various ways of dealing with it, depending upon the circumstances:

- Discard it, and all related data.
- Interpolate values from surrounding data
- Isolate it and analyze it separately

Which approach is best is a scientific question.  Whatever approach is chosen, pandas has computational methods to carry it out.

Read a csv file that contains NaNs. Note here, index_col is set to 0.  This means the first column is used the index.

In [118]:
df_miss = pd.read_csv('missing.csv', index_col=0)  # index_col = 0 means first column is used as index
df_miss

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

To figure out where the missing data is, use the `isnull` method.

In [119]:
df_miss.isnull()

     one    two  three   four
a  False  False  False  False
b   True  False  False  False
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False   True   True  False

Summing up the boolean array reports how many missing values are in each column.

In [120]:
np.sum(df_miss.isnull())

one      2
two      2
three    2
four     1
dtype: int64

The same is possible for rows by setting the axis parameter to 1.

In [6]:
np.sum(df_miss.isnull(), axis=1)

a    0
b    1
c    0
d    4
e    0
f    2
dtype: int64

To isolate the rows in which there are null values, aggregate the `df.isnull()` boolean data frame along rows, using `any` with `axis=1`.

In [8]:
mask=df_miss.isnull().any(axis=1)
mask

a    False
b     True
c    False
d     True
e    False
f     True
dtype: bool

Passing the boolean Series to the first position of the `loc` method of the DataFrame selects the rows:

In [9]:
df_miss.loc[mask,:]

       one       two     three      four
b      NaN -0.217766  0.655179  1.379276
d      NaN       NaN       NaN       NaN
f -1.14906       NaN       NaN -0.160499

**Exercise 5**
- Handling NaNs has been shown, however, not all missing values are NaNs. Consider the example below:

```
Employee = pd.read_csv('Employee_continue.csv')
```

Print the data frame, looking for missing values by inspection. How many missing values are there? Some of the missing values might not be NaNs.

In [125]:
Employee = pd.read_csv('Employee_continue.csv')
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5          ?       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT         ?   F         VP   9.0      Mary   262.5

- See '?' in the data frame. For a small data frame like this the '?' may be replaced by `np.nan` manually. In dealing with a large data frame, it is more efficient to use the function `replace`. Use `replace` to swap '?' with `np.nan`.

In [126]:
#### Your code here

Employee2 = Employee.replace('?', np.NaN)
Employee2

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT       NaN   F         VP   9.0      Mary   262.5

- How many missing values are there in each row? How many in each column?

In [129]:
#### Your code here

# each column:

print np.sum(Employee2.isnull())

# each row:

print np.sum(Employee2.isnull(), axis=1)

Department    1
Education     1
Sex           0
Title         0
Year          1
Name          0
Salary        0
dtype: int64
0    0
1    0
2    0
3    0
4    0
5    1
6    1
7    0
8    1
dtype: int64

- Print the rows with missing values.

In [130]:
#### Your code here

mask=Employee2.isnull().any(axis=1)
Employee2.loc[mask,:]

  Department Education Sex      Title  Year      Name  Salary
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
8         IT       NaN   F         VP   9.0      Mary   262.5

- Print the columns with missing values.

In [131]:
#### Your code here

mask=Employee2.isnull().any(axis=0)
Employee2.loc[:,mask]

  Department Education  Year
0         IT  Bachelor   1.0
1         IT    Master   2.0
2         HR    Master   2.0
3         HR  Bachelor   2.0
4      Trade       PHD   3.0
5        NaN       PHD   5.0
6      Trade    Master   NaN
7         HR    Master   8.0
8         IT       NaN   9.0

Once all the missing values are represented by `NaN`s, Pandas provides various methods for handling them:

<p><a name="dropna"></a></p>
## dropna
One option is to discard the rows with missing values. Below the arguments `axis=0` and `how='any'` indicate dropping *rows* with a NaN in *any* position.

In [10]:
df_miss.dropna(axis=0, how='any')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
c -0.860359 -1.313747  0.676174  1.034417
e  0.079169  0.029138  0.239183 -0.492039

Another option is to drop rows full of NaNs. This can be done with `how='all'`.

In [11]:
df_miss.dropna(axis=0, how='all')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

Applying `dropna` to the above data frame may be done once more. Drop a column with the argument `axis=1`.

In [12]:
df_miss.dropna(axis=0, how='all').dropna(axis=1, how='any')

       four
a -1.015682
b  1.379276
c  1.034417
e -0.492039
f -0.160499

<p><a name="fillna"></a></p>
## fillna

An alternative to discarding information is to **impute** the data. This can be done with the `fillna` function with the value to be imputed as the argument.

In [14]:
df_miss.fillna(0)

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b  0.000000 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d  0.000000  0.000000  0.000000  0.000000
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.000000  0.000000 -0.160499

- Another common way to impute is by the mean of the column.

In [16]:
df_miss['one'].fillna(df_miss['one'].mean())

a   -1.250699
b   -0.795237
c   -0.860359
d   -0.795237
e    0.079169
f   -1.149060
Name: one, dtype: float64

<p><a name="interpolate"></a></p>
## Interpolate

Interpolation is the insertion of new data between preeexisting fixed points. Linear interpolation uses a linear function to create new data point.  In pandas this is accomplished using `interpolate` with the method parameter set to linear,`method='linear'`.  This will fill in missing data points using linear interpolation between the data points bordering the missing values.

In [18]:
df_miss

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

In [17]:
df_miss.interpolate(method='linear')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b -1.055529 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d -0.390595 -0.642305  0.457679  0.271189
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.029138  0.239183 -0.160499

- Since `df.loc['b','one']` is a NaN between `df.loc['a','one']` and `df.loc['c','one']`, the value inserted is the mean of them.

In [19]:
(df_miss.loc['a', 'one'] + df_miss.loc['c', 'one'])/2

-1.0555289364489999

Note how this technique treats NaN values at the bottom of a column.

<p><a name="grouping"></a></p>

# Grouping and Aggregation

Grouping and  aggregation are critical components of data analysis which involve:

- **Splitting** data into groups based on some features.
- **Applying** a function to each group independently.
- **Combining** the result into data structure.

### Grouping

Grouping splits a data frame into categorical groups, according to a given variable, or set of variables.   Consider the following data frame.

In [132]:
Country = pd.read_csv('countries.csv',delimiter=';')
Country.head(2)

,Country,Country (de),Country (local),Country code,Continent,Capital,Population,Area,Coastline,Government form,Currency,Currency code,Dialing prefix,Birthrate,Deathrate,Life expectancy,Url
0,Afghanistan,Afghanistan,Afganistan/Afqanestan,AF,Asia,Kabul,33332025,652230,0,Presidential islamic republic,Afghani,AFN,93,38.3,13.7,51.3,https://www.laenderdaten.info/Asien/Afghanista...
1,Egypt,Ägypten,Misr,EG,Africa,Cairo,94666993,1001450,2450,Presidential republic,Pfund,EGP,20,30.3,4.7,72.7,https://www.laenderdaten.info/Afrika/Aegypten/...

In [133]:
Country=Country[['Country','Continent','Population','Area','Coastline',
                'Currency','Birthrate','Deathrate','Life expectancy']]
Country.columns = Country.columns.str.lower()
Country=Country.dropna(axis=0, how='any')
Country=Country[Country['population']>20000000]
Country=Country.reset_index()
del(Country['index'])
Country['coastal']=Country['coastline']!=0
Country

,country,continent,population,area,coastline,currency,birthrate,deathrate,life expectancy,coastal
0,Afghanistan,Asia,33332025,652230,0,Afghani,38.3,13.7,51.3,False
1,Egypt,Africa,94666993,1001450,2450,Pfund,30.3,4.7,72.7,True
2,Algeria,Africa,40263711,2381741,998,Dinar,23.0,4.3,76.8,True
3,Angola,Africa,20172332,1246700,1600,Kwanza,38.6,11.3,56.0,True
4,Argentina,South America,43886748,2780400,4989,Peso,17.0,7.5,77.1,True
5,Ethiopia,Africa,102374044,1104300,0,Birr,36.9,7.9,62.2,False
6,Australia,Australia,22992654,7741220,25760,Dollar,12.1,7.2,82.2,True
7,Bangladesh,Asia,156186882,143998,580,Taka,19.0,5.3,73.2,True
8,Brazil,South America,205823665,8514877,7491,Real,14.3,6.6,73.8,True
9,China,Asia,1373541278,9596960,14500,Yuan,12.4,7.7,75.5,True
10,Democratic Republic of the Congo,Africa,81331050,2344858,37,Franc,34.2,9.9,57.3,True
11,Germany,Europe,80722792,357022,2389,Euro,8.5,11.6,80.7,True
12,Ivory Coast,Africa,23740424,322463,515,Franc,28.2,9.5,58.7,True
13,France,Europe,66836154,643801,3427,Euro,12.3,9.3,81.8,True
14,Ghana,Africa,26908262,238533,539,Ghana Cedi,30.8,7.1,66.6,True
15,India,Asia,1266883598,3287263,7000,Rupie,19.3,7.3,68.5,True
16,Indonesia,Asia,258316051,1904569,54716,Rupiah,16.4,6.4,72.7,True
17,Iraq,Asia,38146025,438317,58,Dinar,30.9,3.8,74.9,True
18,Iran,Asia,82801633,1648195,2440,Rial,17.8,5.9,71.4,True
19,Italy,Europe,62007540,301340,7600,Euro,8.7,10.3,82.2,True
20,Japan,Asia,126702133,377915,29751,Yen,7.8,9.6,85.0,True
21,Yemen,Asia,27392779,527968,1906,Rial,29.2,6.1,65.5,True
22,Cameroon,Africa,24360803,475440,402,Franc,35.8,9.8,58.5,True
23,Canada,North America,35362905,9984670,202080,Dollar,10.3,8.5,81.9,True
24,Kenya,Africa,46790758,580367,536,Schilling,25.1,6.8,64.0,True
25,Colombia,South America,47220856,1138910,3208,Peso,16.3,5.4,75.7,True
26,Madagascar,Africa,24430325,587041,4828,Ariary,32.1,6.7,65.9,True
27,Malaysia,Asia,30949962,329847,4675,Ringgit,19.4,5.1,75.0,True
28,Morocco,Africa,33655786,446550,1835,Dirham,18.0,4.8,76.9,True
29,Mexico,North America,123166749,1964375,9330,Peso,18.5,5.3,75.9,True
30,Mozambique,Africa,25930150,799380,2470,Metical,38.3,11.9,53.3,True
31,Burma,Asia,56890418,676578,1930,Kyat,18.2,7.9,66.6,True
32,Nepal,Asia,29033914,147181,0,Rupie,19.9,5.7,70.7,False
33,Nigeria,Africa,186053386,923768,853,Naira,37.3,12.7,53.4,True
34,North Korea,Asia,25115311,120538,2495,Won,14.6,9.3,70.4,True
35,Pakistan,Asia,201995540,796095,1046,Rupie,22.3,6.4,67.7,True
36,Peru,South America,30741062,1285216,2414,Nuevo Sol,18.0,6.0,73.7,True
37,Philippines,Asia,102624209,300000,36289,Peso,24.0,6.1,69.2,True
38,Poland,Europe,38523261,312685,440,Zloty,9.6,10.3,77.6,True
39,Romania,Europe,21599736,238391,225,Leu,9.0,11.9,75.1,True
40,Russia,Europe,142355415,17098242,37653,Rubel,11.3,13.6,70.8,True
41,Saudi Arabia,Asia,28160273,2149690,2640,Riyal,18.4,3.3,75.3,True
42,Spain,Europe,48563476,505370,4964,Euro,9.4,9.1,81.7,True
43,Sri Lanka,Asia,22235000,65610,1340,Rupie,15.5,6.2,76.8,True
44,South Africa,Africa,54300704,1219090,2798,Rand,20.5,9.6,63.1,True
45,Sudan,Africa,36729501,1861484,853,Pfund,28.5,7.5,64.1,True
46,South Korea,Asia,50924172,99720,2413,Won,8.4,5.8,82.4,True
47,Taiwan,Asia,23464787,35980,1566,Dollar,8.4,7.3,80.1,True
48,Tanzania,Africa,52482726,947300,1424,Schilling,36.0,7.8,62.2,True
49,Thailand,Asia,68200824,513120,3219,Baht,11.1,7.9,74.7,True
50,Turkey,Asia,80274604,783562,7200,Lira,16.0,5.9,74.8,True
51,Uganda,Africa,38319241,241038,0,Schilling,43.4,10.4,55.4,False
52,Ukraine,Europe,44209733,603550,2782,Hrywnja,10.5,14.4,71.8,True
53,Uzbekistan,Asia,29473614,447400,0,So'm,16.9,5.3,73.8,False
54,Venezuela,South America,30912302,912050,2800,Bolívar Fuerte,19.2,5.2,75.8,True
55,United States,North America,323995528,9826675,19924,Dollar,12.5,8.2,79.8,True
56,United Kingdom,Europe,64430428,243610,12429,Pfund,12.1,9.4,80.7,True
57,Vietnam,Asia,95261021,331210,3444,Dong,15.7,5.9,73.4,True

To group the countries by continent, do the following:

In [134]:
group = Country.groupby('continent')

`group` is assigned the value returned by the `groupby` function, whose type is:

In [135]:
print(type(group))

<class 'pandas.core.groupby.DataFrameGroupBy'>

The `DataFrameGroupBy` object is an `iterable`. Iterate over the object and print the contents, as follows:

In [136]:
for item in group:
    print(item)

('Africa',                              country continent  population     area  \
1                              Egypt    Africa    94666993  1001450
2                            Algeria    Africa    40263711  2381741
3                             Angola    Africa    20172332  1246700
5                           Ethiopia    Africa   102374044  1104300
10  Democratic Republic of the Congo    Africa    81331050  2344858
12                       Ivory Coast    Africa    23740424   322463
14                             Ghana    Africa    26908262   238533
22                          Cameroon    Africa    24360803   475440
24                             Kenya    Africa    46790758   580367
26                        Madagascar    Africa    24430325   587041
28                           Morocco    Africa    33655786   446550
30                        Mozambique    Africa    25930150   799380
33                           Nigeria    Africa   186053386   923768
44                      South Africa    Africa    54300704  1219090
45                             Sudan    Africa    36729501  1861484
48                          Tanzania    Africa    52482726   947300
51                            Uganda    Africa    38319241   241038

    coastline    currency  birthrate  deathrate  life expectancy coastal
1        2450       Pfund       30.3        4.7             72.7    True
2         998       Dinar       23.0        4.3             76.8    True
3        1600      Kwanza       38.6       11.3             56.0    True
5           0        Birr       36.9        7.9             62.2   False
10         37       Franc       34.2        9.9             57.3    True
12        515       Franc       28.2        9.5             58.7    True
14        539  Ghana Cedi       30.8        7.1             66.6    True
22        402       Franc       35.8        9.8             58.5    True
24        536   Schilling       25.1        6.8             64.0    True
26       4828      Ariary       32.1        6.7             65.9    True
28       1835      Dirham       18.0        4.8             76.9    True
30       2470     Metical       38.3       11.9             53.3    True
33        853       Naira       37.3       12.7             53.4    True
44       2798        Rand       20.5        9.6             63.1    True
45        853       Pfund       28.5        7.5             64.1    True
48       1424   Schilling       36.0        7.8             62.2    True
51          0   Schilling       43.4       10.4             55.4   False  )
('Asia',          country continent  population     area  coastline currency  \
0    Afghanistan      Asia    33332025   652230          0  Afghani
7     Bangladesh      Asia   156186882   143998        580     Taka
9          China      Asia  1373541278  9596960      14500     Yuan
15         India      Asia  1266883598  3287263       7000    Rupie
16     Indonesia      Asia   258316051  1904569      54716   Rupiah
17          Iraq      Asia    38146025   438317         58    Dinar
18          Iran      Asia    82801633  1648195       2440     Rial
20         Japan      Asia   126702133   377915      29751      Yen
21         Yemen      Asia    27392779   527968       1906     Rial
27      Malaysia      Asia    30949962   329847       4675  Ringgit
31         Burma      Asia    56890418   676578       1930     Kyat
32         Nepal      Asia    29033914   147181          0    Rupie
34   North Korea      Asia    25115311   120538       2495      Won
35      Pakistan      Asia   201995540   796095       1046    Rupie
37   Philippines      Asia   102624209   300000      36289     Peso
41  Saudi Arabia      Asia    28160273  2149690       2640    Riyal
43     Sri Lanka      Asia    22235000    65610       1340    Rupie
46   South Korea      Asia    50924172    99720       2413      Won
47        Taiwan      Asia    23464787    35980       1566   Dollar
49      Thailand      Asia    68200824   513120       3219     Baht
50        Turkey      Asia    80274604   783562       7200     Lira
53    Uzbekistan      Asia    29473614   447400          0     So'm
57       Vietnam      Asia    95261021   331210       3444     Dong

    birthrate  deathrate  life expectancy coastal
0        38.3       13.7             51.3   False
7        19.0        5.3             73.2    True
9        12.4        7.7             75.5    True
15       19.3        7.3             68.5    True
16       16.4        6.4             72.7    True
17       30.9        3.8             74.9    True
18       17.8        5.9             71.4    True
20        7.8        9.6             85.0    True
21       29.2        6.1             65.5    True
27       19.4        5.1             75.0    True
31       18.2        7.9             66.6    True
32       19.9        5.7             70.7   False
34       14.6        9.3             70.4    True
35       22.3        6.4             67.7    True
37       24.0        6.1             69.2    True
41       18.4        3.3             75.3    True
43       15.5        6.2             76.8    True
46        8.4        5.8             82.4    True
47        8.4        7.3             80.1    True
49       11.1        7.9             74.7    True
50       16.0        5.9             74.8    True
53       16.9        5.3             73.8   False
57       15.7        5.9             73.4    True  )
('Australia',      country  continent  population     area  coastline currency  birthrate  \
6  Australia  Australia    22992654  7741220      25760   Dollar       12.1

   deathrate  life expectancy coastal
6        7.2             82.2    True  )
('Europe',            country continent  population      area  coastline currency  \
11         Germany    Europe    80722792    357022       2389     Euro
13          France    Europe    66836154    643801       3427     Euro
19           Italy    Europe    62007540    301340       7600     Euro
38          Poland    Europe    38523261    312685        440    Zloty
39         Romania    Europe    21599736    238391        225      Leu
40          Russia    Europe   142355415  17098242      37653    Rubel
42           Spain    Europe    48563476    505370       4964     Euro
52         Ukraine    Europe    44209733    603550       2782  Hrywnja
56  United Kingdom    Europe    64430428    243610      12429    Pfund

    birthrate  deathrate  life expectancy coastal
11        8.5       11.6             80.7    True
13       12.3        9.3             81.8    True
19        8.7       10.3             82.2    True
38        9.6       10.3             77.6    True
39        9.0       11.9             75.1    True
40       11.3       13.6             70.8    True
42        9.4        9.1             81.7    True
52       10.5       14.4             71.8    True
56       12.1        9.4             80.7    True  )
('North America',           country      continent  population     area  coastline currency  \
23         Canada  North America    35362905  9984670     202080   Dollar
29         Mexico  North America   123166749  1964375       9330     Peso
55  United States  North America   323995528  9826675      19924   Dollar

    birthrate  deathrate  life expectancy coastal
23       10.3        8.5             81.9    True
29       18.5        5.3             75.9    True
55       12.5        8.2             79.8    True  )
('South America',       country      continent  population     area  coastline        currency  \
4   Argentina  South America    43886748  2780400       4989            Peso
8      Brazil  South America   205823665  8514877       7491            Real
25   Colombia  South America    47220856  1138910       3208            Peso
36       Peru  South America    30741062  1285216       2414       Nuevo Sol
54  Venezuela  South America    30912302   912050       2800  Bolívar Fuerte

    birthrate  deathrate  life expectancy coastal
4        17.0        7.5             77.1    True
8        14.3        6.6             73.8    True
25       16.3        5.4             75.7    True
36       18.0        6.0             73.7    True
54       19.2        5.2             75.8    True  )

Each `item` we print is a `tuple`. In Python, there is an alternative way of iteration:

In [68]:
for key, values in group:
    print(key)
    print('-'*70)
    print(values)
    print('\n')

Africa
----------------------------------------------------------------------
                             country continent  population     area  \
1                              Egypt    Africa    94666993  1001450
2                            Algeria    Africa    40263711  2381741
3                             Angola    Africa    20172332  1246700
5                           Ethiopia    Africa   102374044  1104300
9                              Benin    Africa    10741458   112622
12                      Burkina Faso    Africa    19512533   274200
13                           Burundi    Africa    11099298    27830
16  Democratic Republic of the Congo    Africa    81331050  2344858
20                       Ivory Coast    Africa    23740424   322463
22                             Ghana    Africa    26908262   238533
25                            Guinea    Africa    12093349   245857
35                          Cameroon    Africa    24360803   475440
38                             Kenya    Africa    46790758   580367
41                        Madagascar    Africa    24430325   587041
42                            Malawi    Africa    18570321   118484
44                              Mali    Africa    17467108  1240192
45                           Morocco    Africa    33655786   446550
47                        Mozambique    Africa    25930150   799380
51                             Niger    Africa    18638600  1267000
52                           Nigeria    Africa   186053386   923768
59                            Rwanda    Africa    12988423    26338
62                            Zambia    Africa    15510711   752618
64                           Senegal    Africa    14320055   196722
65                          Zimbabwe    Africa    14546961   390757
66                           Somalia    Africa    10817354   637657
69                      South Africa    Africa    54300704  1219090
70                             Sudan    Africa    36729501  1861484
72                       South Sudan    Africa    12530717   644329
75                          Tanzania    Africa    52482726   947300
77                              Chad    Africa    11852462  1284000
79                           Tunisia    Africa    11134588   163610
81                            Uganda    Africa    38319241   241038

    coastline    currency  birthrate  deathrate  life expectancy coastal
1        2450       Pfund       30.3        4.7             72.7    True
2         998       Dinar       23.0        4.3             76.8    True
3        1600      Kwanza       38.6       11.3             56.0    True
5           0        Birr       36.9        7.9             62.2   False
9         121       Franc       35.5        8.0             61.9    True
12          0       Franc       41.6       11.5             55.5   False
13          0       Franc       41.7        9.0             60.5   False
16         37       Franc       34.2        9.9             57.3    True
20        515       Franc       28.2        9.5             58.7    True
22        539  Ghana Cedi       30.8        7.1             66.6    True
25        320       Franc       35.4        9.2             60.6    True
35        402       Franc       35.8        9.8             58.5    True
38        536   Schilling       25.1        6.8             64.0    True
41       4828      Ariary       32.1        6.7             65.9    True
42          0      Kwacha       41.3        8.1             61.2   False
44          0       Franc       44.4       12.6             55.8   False
45       1835      Dirham       18.0        4.8             76.9    True
47       2470     Metical       38.3       11.9             53.3    True
51          0       Franc       44.8       12.1             55.5   False
52        853       Naira       37.3       12.7             53.4    True
59          0       Franc       33.3        8.8             60.1   False
62          0      Kwacha       41.8       12.4             52.5   False
64        531       Franc       34.0        8.3             61.7    True
65          0      Dollar       31.9        9.9             58.0   False
66       3025   Schilling       40.0       13.3             52.4    True
69       2798        Rand       20.5        9.6             63.1    True
70        853       Pfund       28.5        7.5             64.1    True
72          0       Pfund       36.2        8.0              0.0   False
75       1424   Schilling       36.0        7.8             62.2    True
77          0       Franc       36.1       14.0             50.2   False
79       1148       Dinar       16.4        6.0             76.1    True
81          0   Schilling       43.4       10.4             55.4   False


Asia
----------------------------------------------------------------------
         country continent  population     area  coastline currency  \
0    Afghanistan      Asia    33332025   652230          0  Afghani
7     Bangladesh      Asia   156186882   143998        580     Taka
15         China      Asia  1373541278  9596960      14500     Yuan
27         India      Asia  1266883598  3287263       7000    Rupie
28     Indonesia      Asia   258316051  1904569      54716   Rupiah
29          Iraq      Asia    38146025   438317         58    Dinar
30          Iran      Asia    82801633  1648195       2440     Rial
32         Japan      Asia   126702133   377915      29751      Yen
33         Yemen      Asia    27392779   527968       1906     Rial
34      Cambodia      Asia    15957223   181035        443     Riel
37    Kazakhstan      Asia    18360353  2724900          0    Tenge
43      Malaysia      Asia    30949962   329847       4675  Ringgit
48         Burma      Asia    56890418   676578       1930     Kyat
49         Nepal      Asia    29033914   147181          0    Rupie
53   North Korea      Asia    25115311   120538       2495      Won
54      Pakistan      Asia   201995540   796095       1046    Rupie
56   Philippines      Asia   102624209   300000      36289     Peso
63  Saudi Arabia      Asia    28160273  2149690       2640    Riyal
68     Sri Lanka      Asia    22235000    65610       1340    Rupie
71   South Korea      Asia    50924172    99720       2413      Won
73         Syria      Asia    17185170   185180        193    Pfund
74        Taiwan      Asia    23464787    35980       1566   Dollar
76      Thailand      Asia    68200824   513120       3219     Baht
80        Turkey      Asia    80274604   783562       7200     Lira
83    Uzbekistan      Asia    29473614   447400          0     So'm
87       Vietnam      Asia    95261021   331210       3444     Dong

    birthrate  deathrate  life expectancy coastal
0        38.3       13.7             51.3   False
7        19.0        5.3             73.2    True
15       12.4        7.7             75.5    True
27       19.3        7.3             68.5    True
28       16.4        6.4             72.7    True
29       30.9        3.8             74.9    True
30       17.8        5.9             71.4    True
32        7.8        9.6             85.0    True
33       29.2        6.1             65.5    True
34       23.4        7.6             64.5    True
37       18.7        8.2             70.8   False
43       19.4        5.1             75.0    True
48       18.2        7.9             66.6    True
49       19.9        5.7             70.7   False
53       14.6        9.3             70.4    True
54       22.3        6.4             67.7    True
56       24.0        6.1             69.2    True
63       18.4        3.3             75.3    True
68       15.5        6.2             76.8    True
71        8.4        5.8             82.4    True
73       21.7        4.0             74.9    True
74        8.4        7.3             80.1    True
76       11.1        7.9             74.7    True
80       16.0        5.9             74.8    True
83       16.9        5.3             73.8   False
87       15.7        5.9             73.4    True


Australia
----------------------------------------------------------------------
     country  continent  population     area  coastline currency  birthrate  \
6  Australia  Australia    22992654  7741220      25760   Dollar       12.1

   deathrate  life expectancy coastal
6        7.2             82.2    True


Central America
----------------------------------------------------------------------
      country        continent  population    area  coastline currency  \
24  Guatemala  Central America    15189958  108889        400  Quetzal

    birthrate  deathrate  life expectancy coastal
24       24.5        4.7             72.3    True


Europe
----------------------------------------------------------------------
           country continent  population      area  coastline currency  \
8          Belgium    Europe    11409077     30528         67     Euro
17         Germany    Europe    80722792    357022       2389     Euro
21          France    Europe    66836154    643801       3427     Euro
23          Greece    Europe    10773253    131957      13676     Euro
31           Italy    Europe    62007540    301340       7600     Euro
50     Netherlands    Europe    17016967     41543        451     Euro
57          Poland    Europe    38523261    312685        440    Zloty
58        Portugal    Europe    10833816     92090       1793     Euro
60         Romania    Europe    21599736    238391        225      Leu
61          Russia    Europe   142355415  17098242      37653    Rubel
67           Spain    Europe    48563476    505370       4964     Euro
78  Czech Republic    Europe    10644842     78867          0    Krone
82         Ukraine    Europe    44209733    603550       2782  Hrywnja
86  United Kingdom    Europe    64430428    243610      12429    Pfund

    birthrate  deathrate  life expectancy coastal
8        11.4        9.7             81.0    True
17        8.5       11.6             80.7    True
21       12.3        9.3             81.8    True
23        8.5       11.2             80.5    True
31        8.7       10.3             82.2    True
50       10.9        8.8             81.3    True
57        9.6       10.3             77.6    True
58        9.1       11.1             79.3    True
60        9.0       11.9             75.1    True
61       11.3       13.6             70.8    True
67        9.4        9.1             81.7    True
78        9.5       10.4             78.6   False
82       10.5       14.4             71.8    True
86       12.1        9.4             80.7    True


North America
----------------------------------------------------------------------
               country      continent  population     area  coastline  \
18  Dominican Republic  North America    10606865    48670       1288
26               Haiti  North America    10485800    27750       1771
36              Canada  North America    35362905  9984670     202080
40                Cuba  North America    11179995   110860       3735
46              Mexico  North America   123166749  1964375       9330
85       United States  North America   323995528  9826675      19924

   currency  birthrate  deathrate  life expectancy coastal
18     Peso       18.6        4.6             78.1    True
26   Gourde       23.3        7.7             63.8    True
36   Dollar       10.3        8.5             81.9    True
40     Peso       10.8        8.6             78.7    True
46     Peso       18.5        5.3             75.9    True
85   Dollar       12.5        8.2             79.8    True


South America
----------------------------------------------------------------------
      country      continent  population     area  coastline        currency  \
4   Argentina  South America    43886748  2780400       4989            Peso
10    Bolivia  South America    10969649  1098581          0       Boliviano
11     Brazil  South America   205823665  8514877       7491            Real
14      Chile  South America    17650114   756102       6435            Peso
19    Ecuador  South America    16080778   283561       2237          Dollar
39   Colombia  South America    47220856  1138910       3208            Peso
55       Peru  South America    30741062  1285216       2414       Nuevo Sol
84  Venezuela  South America    30912302   912050       2800  Bolívar Fuerte

    birthrate  deathrate  life expectancy coastal
4        17.0        7.5             77.1    True
10       22.4        6.5             69.2   False
11       14.3        6.6             73.8    True
14       13.7        6.1             78.8    True
19       18.2        5.1             76.8    True
39       16.3        5.4             75.7    True
55       18.0        6.0             73.7    True
84       19.2        5.2             75.8    True

This is a great way to print and inspect a `DataFrameGroupBy` object. Above was an example of **splitting**.

**Applying** and **combining** are often done together with a single function. For example:

In [138]:
group.size()

continent
Africa           17
Asia             23
Australia         1
Europe            9
North America     3
South America     5
dtype: int64

In [139]:
group.mean()

,population,area,coastline,birthrate,deathrate,life expectancy,coastal
continent,,,,,,,
Africa,5.367707e+07,9.836178e+05,1302.235294,31.588235,8.394118,62.770588,0.882353
Asia,1.829524e+08,1.103215e+06,7791.652174,18.256522,6.691304,72.560870,0.869565
Australia,2.299265e+07,7.741220e+06,25760.000000,12.100000,7.200000,82.200000,1.000000
Europe,6.324984e+07,2.256001e+06,7989.888889,10.155556,11.100000,78.044444,1.000000
North America,1.608417e+08,7.258573e+06,77111.333333,13.766667,7.333333,79.200000,1.000000
South America,7.171693e+07,2.926291e+06,4180.400000,16.960000,6.140000,75.220000,1.000000

### Aggregration

The data frame can be grouped by multiple keys:

In [140]:
group2 = Country.groupby(['continent', 'currency','country'])

Apply multiple functions to each group with the method `agg`:

In [141]:
group.agg(['count', 'sum', 'min', 'max', 'mean', 'std'])

              population                                               \
                   count         sum       min         max       mean
continent
Africa                17   912510196  20172332   186053386   53677070
Asia                  23  4207906053  22235000  1373541278  182952437
Australia              1    22992654  22992654    22992654   22992654
Europe                 9   569248535  21599736   142355415   63249837
North America          3   482525182  35362905   323995528  160841727
South America          5   358584633  30741062   205823665   71716926

                             area                                 ...     \
                        std count       sum      min       max    ...
continent                                                         ...
Africa         4.236223e+07    17  16721503   238533   2381741    ...
Asia           3.644163e+08    23  25373946    35980   9596960    ...
Australia               NaN     1   7741220  7741220   7741220    ...
Europe         3.446582e+07     9  20304011   238391  17098242    ...
North America  1.479586e+08     3  21775720  1964375   9984670    ...
South America  7.533796e+07     5  14631453   912050   8514877    ...

              life expectancy                            coastal               \
                          min   max       mean       std   count   sum    min
continent
Africa                   53.3  76.9  62.770588  7.356780      17  15.0  False
Asia                     51.3  85.0  72.560870  6.621160      23  20.0  False
Australia                82.2  82.2  82.200000       NaN       1   1.0   True
Europe                   70.8  82.2  78.044444  4.460693       9   9.0   True
North America            75.9  81.9  79.200000  3.044667       3   3.0   True
South America            73.7  77.1  75.220000  1.451551       5   5.0   True


                max      mean       std
continent
Africa         True  0.882353  0.332106
Asia           True  0.869565  0.344350
Australia      True  1.000000       NaN
Europe         True  1.000000  0.000000
North America  True  1.000000  0.000000
South America  True  1.000000  0.000000

[6 rows x 42 columns]

To look at a single column of the aggregate analysis, use the column indexing:

In [76]:
group.agg(['count', 'sum', 'min', 'max', 'mean', 'std'])['birthrate']

                 count     sum   min   max       mean       std
continent
Africa              32  1091.4  16.4  44.8  34.106250  7.414499
Asia                26   483.7   7.8  38.3  18.603846  6.925286
Australia            1    12.1  12.1  12.1  12.100000       NaN
Central America      1    24.5  24.5  24.5  24.500000       NaN
Europe              14   140.8   8.5  12.3  10.057143  1.334002
North America        6    94.0  10.3  23.3  15.666667  5.242391
South America        8   139.1  13.7  22.4  17.387500  2.775113

The column std misses two values above because Australia and Central America have only one row in the data frame.

Also note that `sum` is an inappropriate function to apply to birthrate where it would be applicable to population.

Different aggregating functions can be applied to different columns. This can be done with a dictionary.

In [80]:
print(Country.columns.tolist())

['country', 'continent', 'population', 'area', 'coastline', 'currency', 'birthrate', 'deathrate', 'life expectancy', 'coastal']

In [83]:
colFun = {'population': ['sum','min', 'max','mean','std'], 
          'area': ['sum','min', 'max','mean'],
          'coastline':['sum','min', 'max'],
          'birthrate':['min', 'max','mean','std'],
          'deathrate':['min', 'max','mean','std'],
          'life expectancy':['min', 'max','mean','std']}
analysis=group.agg(colFun)
analysis

                 population                                                 \
                        sum       min         max       mean           std
continent
Africa           1124334134  10741458   186053386   35135441  3.650771e+07
Asia             4259408799  15957223  1373541278  163823415  3.460939e+08
Australia          22992654  22992654    22992654   22992654           NaN
Central America    15189958  15189958    15189958   15189958           NaN
Europe            629926490  10644842   142355415   44994749  3.713917e+07
North America     514797842  10485800   323995528   85799640  1.245565e+08
South America     403285174  10969649   205823665   50410646  6.412087e+07

                     area                             coastline    ...      \
                      sum      min       max     mean       sum    ...
continent                                                          ...
Africa           24103719    26338   2381741   753241     27283    ...
Asia             28465061    35980   9596960  1094810    179844    ...
Australia         7741220  7741220   7741220  7741220     25760    ...
Central America    108889   108889    108889   108889       400    ...
Europe           20678996    30528  17098242  1477071     87896    ...
North America    21963000    27750   9984670  3660500    238128    ...
South America    16769697   283561   8514877  2096212     29574    ...

                 birthrate           deathrate                             \
                      mean       std       min   max       mean       std
continent
Africa           34.106250  7.414499       4.3  14.0   9.184375  2.566799
Asia             18.603846  6.925286       3.3  13.7   6.680769  2.101812
Australia        12.100000       NaN       7.2   7.2   7.200000       NaN
Central America  24.500000       NaN       4.7   4.7   4.700000       NaN
Europe           10.057143  1.334002       8.8  14.4  10.792857  1.661077
North America    15.666667  5.242391       4.6   8.6   7.150000  1.746711
South America    17.387500  2.775113       5.1   7.5   6.050000  0.815913

                life expectancy
                            min   max       mean        std
continent
Africa                      0.0  76.9  59.034375  12.834646
Asia                       51.3  85.0  72.273077   6.436990
Australia                  82.2  82.2  82.200000        NaN
Central America            72.3  72.3  72.300000        NaN
Europe                     70.8  82.2  78.792857   3.706432
North America              63.8  81.9  76.366667   6.465189
South America              69.2  78.8  75.112500   2.924985

[7 rows x 24 columns]

In [85]:
analysis[['population', 'area', 'coastline']]

                 population                                                 \
                        sum       min         max       mean           std
continent
Africa           1124334134  10741458   186053386   35135441  3.650771e+07
Asia             4259408799  15957223  1373541278  163823415  3.460939e+08
Australia          22992654  22992654    22992654   22992654           NaN
Central America    15189958  15189958    15189958   15189958           NaN
Europe            629926490  10644842   142355415   44994749  3.713917e+07
North America     514797842  10485800   323995528   85799640  1.245565e+08
South America     403285174  10969649   205823665   50410646  6.412087e+07

                     area                             coastline
                      sum      min       max     mean       sum    min     max
continent
Africa           24103719    26338   2381741   753241     27283      0    4828
Asia             28465061    35980   9596960  1094810    179844      0   54716
Australia         7741220  7741220   7741220  7741220     25760  25760   25760
Central America    108889   108889    108889   108889       400    400     400
Europe           20678996    30528  17098242  1477071     87896      0   37653
North America    21963000    27750   9984670  3660500    238128   1288  202080
South America    16769697   283561   8514877  2096212     29574      0    7491

In [86]:
analysis[['birthrate', 'deathrate', 'life expectancy']]

                birthrate                            deathrate        \
                      min   max       mean       std       min   max
continent
Africa               16.4  44.8  34.106250  7.414499       4.3  14.0
Asia                  7.8  38.3  18.603846  6.925286       3.3  13.7
Australia            12.1  12.1  12.100000       NaN       7.2   7.2
Central America      24.5  24.5  24.500000       NaN       4.7   4.7
Europe                8.5  12.3  10.057143  1.334002       8.8  14.4
North America        10.3  23.3  15.666667  5.242391       4.6   8.6
South America        13.7  22.4  17.387500  2.775113       5.1   7.5

                                     life expectancy                   \
                      mean       std             min   max       mean
continent
Africa            9.184375  2.566799             0.0  76.9  59.034375
Asia              6.680769  2.101812            51.3  85.0  72.273077
Australia         7.200000       NaN            82.2  82.2  82.200000
Central America   4.700000       NaN            72.3  72.3  72.300000
Europe           10.792857  1.661077            70.8  82.2  78.792857
North America     7.150000  1.746711            63.8  81.9  76.366667
South America     6.050000  0.815913            69.2  78.8  75.112500


                       std
continent
Africa           12.834646
Asia              6.436990
Australia              NaN
Central America        NaN
Europe            3.706432
North America     6.465189
South America     2.924985

Custom aggregation functions may also be applied. In the previous examples, aggregation functions are applied to each **column** in a data frame. Keep this in mind when defining a custom function. For example, build a function that computes the mean after removing maxima (truncated mean).

In [97]:
def trunc_mean(x):    # x has to be a 'vector' (1d array or pandas Series)
    sec=x[x!=x.max()]
    if sec.shape[0]!=0:
        return np.mean(x[x!=x.max()])

In [98]:
Country[Country['country']!='Australia' ].groupby('continent').agg(trunc_mean)

,population,area,coastline,birthrate,deathrate,life expectancy,coastal
continent,,,,,,,
Africa,45403550,896235,1081.875000,30.850000,8.125000,61.887500,0.0
Asia,128834762,717135,5658.727273,17.345455,6.372727,71.995455,0.0
Europe,53361640,400721,4282.000000,9.887500,10.687500,77.525000,NaN
North America,79264827,5895525,14627.000000,11.400000,6.750000,77.850000,NaN
South America,38190242,1529144,3352.750000,16.400000,5.800000,74.750000,NaN

**Exercise 6**

Using the data frame Employees:

- Find the minimum, mean and the maximum of the 'Year' for each Department.
- How many female or male are in each department? For each sex in each department, what are the minimum, the mean and the maximum of their salary?
- For each department, compute the difference between the maximal salary and the minimal salary.

In [144]:
#### Your code here

<p><a name="sol"></a></p>
# Solutions

**Exercise 6**

In [ ]:
Employee.groupby('Department')['Year'].agg(['min','max','mean'])
Employee.groupby(['Department', 'Sex']).agg(['size', 'min','max','mean'])
Employee.groupby('Department')[['Salary']].agg(lambda x: x.max()- x.min())